## Staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 3 to add, 2 to change, 9 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.wordpress_ecs_task_get_secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "wordpress_ecs_task_get_secret_value"  {
      ~ id      = "1496438501" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_salt_9tv4ch-esn0hB",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_key_9tv4ch-c1FG85",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_salt_9tv4ch-rfqWnb",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_key_9tv4ch-rD16Mn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_salt_9tv4ch-fHVfaV",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_key_9tv4ch-cu7bvO",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_username_j5ihus-33gyWe",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_password_j5ihus-DCw572",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_name_j5ihus-XAAsB4",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_salt_9tv4ch-7Z7et4",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_key_9tv4ch-Odjot9",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:notify_api_key_9tv4ch-wb4Z7G",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_service_id_9tv4ch-qqjeOC",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_notify_services_9tv4ch-nRDzt1",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_endpoint_9tv4ch-S5UpJr",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_api_key_9tv4ch-K7g2ss",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_api_key_9tv4ch-K7g2ss",
              - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_notify_services_9tv4ch-nRDzt1",
              - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_service_id_9tv4ch-qqjeOC",
              - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:notify_api_key_9tv4ch-wb4Z7G",
              ~ (known after apply),
                # (13 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.wordpress_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "wordpress_container_definition"  {
      ~ id       = "2e69594b2eee5e008db5c8a79175bdb5fa600dc8885a911dc4585f5be98d0319" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "DEFAULT_DOMAIN"
                          - value = "articles.cdssandbox.xyz"
                        },
                      - {
                          - name  = "WORDPRESS_CONFIG_EXTRA"
                          - value = "define('WP_HOME','https://articles.cdssandbox.xyz');define('WP_SITEURL','https://articles.cdssandbox.xyz');define('MYSQL_CLIENT_FLAGS', MYSQLI_CLIENT_SSL);"
                        },
                    ]
                  - essential        = true
                  - image            = "729164266357.dkr.ecr.ca-central-1.amazonaws.com/platform/wordpress:v1.5.2"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "wordpress"
                  - portMappings     = [
                      - {
                          - containerPort = 443
                          - hostPort      = 443
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "LIST_MANAGER_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_api_key_9tv4ch-K7g2ss"
                        },
                      - {
                          - name      = "LIST_MANAGER_ENDPOINT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_endpoint_9tv4ch-S5UpJr"
                        },
                      - {
                          - name      = "LIST_MANAGER_SERVICE_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_service_id_9tv4ch-qqjeOC"
                        },
                      - {
                          - name      = "LIST_MANAGER_NOTIFY_SERVICES"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_notify_services_9tv4ch-nRDzt1"
                        },
                      - {
                          - name      = "NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:notify_api_key_9tv4ch-wb4Z7G"
                        },
                      - {
                          - name      = "WORDPRESS_DB_HOST"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0"
                        },
                      - {
                          - name      = "WORDPRESS_DB_USER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_username_j5ihus-33gyWe"
                        },
                      - {
                          - name      = "WORDPRESS_DB_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_password_j5ihus-DCw572"
                        },
                      - {
                          - name      = "WORDPRESS_DB_NAME"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_name_j5ihus-XAAsB4"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_key_9tv4ch-Odjot9"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_key_9tv4ch-c1FG85"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_key_9tv4ch-cu7bvO"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_key_9tv4ch-rD16Mn"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_salt_9tv4ch-7Z7et4"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_salt_9tv4ch-esn0hB"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_salt_9tv4ch-fHVfaV"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_salt_9tv4ch-rfqWnb"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply)
      ~ template = <<-EOT
            [
              {
                "portMappings": [
                  {
                    "hostPort": 443,
                    "containerPort": 443,
                    "protocol": "tcp"
                  }
                ],
                "logConfiguration": {
                  "logDriver": "awslogs",
                  "options": {
                    "awslogs-group": "${AWS_LOGS_GROUP}",
                    "awslogs-region": "${AWS_LOGS_REGION}",
                    "awslogs-stream-prefix": "${AWS_LOGS_STREAM_PREFIX}"
                  }
                },
                "volumesFrom": [],
                "essential": true,
                "name": "wordpress",
                "image": "${WORDPRESS_IMAGE}",
                "mountPoints": [
                  %{ if ENABLE_EFS }
                  {
                    "containerPath": "/var/www/html/wp-content",
                    "sourceVolume": "wp-content",
                    "readOnly": false
                  }
                  %{ endif }
                ],
                "environment": [
                  {
                    "name": "DEFAULT_DOMAIN",
                    "value": "${DEFAULT_DOMAIN}"
                  },
                  {
                    "name": "WORDPRESS_CONFIG_EXTRA",
                    "value": "${WORDPRESS_CONFIG_EXTRA}"
                  }
                ],
                "secrets": [
                  {
          -         "name": "LIST_MANAGER_API_KEY",
          -         "valueFrom": "${LIST_MANAGER_API_KEY}"
          -       },
          -       {
                    "name": "LIST_MANAGER_ENDPOINT",
                    "valueFrom": "${LIST_MANAGER_ENDPOINT}"
                  },
                  {
          -         "name": "LIST_MANAGER_SERVICE_ID",
          -         "valueFrom": "${LIST_MANAGER_SERVICE_ID}"
          -       }, 
          -       {
          -         "name": "LIST_MANAGER_NOTIFY_SERVICES",
          -         "valueFrom": "${LIST_MANAGER_NOTIFY_SERVICES}"
          -       },     
          -       {
          -         "name": "NOTIFY_API_KEY",
          -         "valueFrom": "${NOTIFY_API_KEY}"
          +         "name": "ENCRYPTION_KEY",
          +         "valueFrom": "${ENCRYPTION_KEY}"
                  },
                  {
                    "name": "WORDPRESS_DB_HOST",
                    "valueFrom": "${WORDPRESS_DB_HOST}"
                  },
                  {
                    "name": "WORDPRESS_DB_USER",
                    "valueFrom": "${WORDPRESS_DB_USER}"
                  },
                  {
                    "name": "WORDPRESS_DB_PASSWORD",
                    "valueFrom": "${WORDPRESS_DB_PASSWORD}"
                  },
                  {
                    "name": "WORDPRESS_DB_NAME",
                    "valueFrom": "${WORDPRESS_DB_NAME}"
                  },
                  {
                    "name": "WORDPRESS_AUTH_KEY",
                    "valueFrom": "${WORDPRESS_AUTH_KEY}"
                  },
                  {
                    "name": "WORDPRESS_SECURE_AUTH_KEY",
                    "valueFrom": "${WORDPRESS_SECURE_AUTH_KEY}"
                  },
                  {
                    "name": "WORDPRESS_LOGGED_IN_KEY",
                    "valueFrom": "${WORDPRESS_LOGGED_IN_KEY}"
                  },
                  {
                    "name": "WORDPRESS_NONCE_KEY",
                    "valueFrom": "${WORDPRESS_NONCE_KEY}"
                  },
                  {
                    "name": "WORDPRESS_AUTH_SALT",
                    "valueFrom": "${WORDPRESS_AUTH_SALT}"
                  },
                  {
                    "name": "WORDPRESS_SECURE_AUTH_SALT",
                    "valueFrom": "${WORDPRESS_SECURE_AUTH_SALT}"
                  },
                  {
                    "name": "WORDPRESS_LOGGED_IN_SALT",
                    "valueFrom": "${WORDPRESS_LOGGED_IN_SALT}"
                  },
                  {
                    "name": "WORDPRESS_NONCE_SALT",
                    "valueFrom": "${WORDPRESS_NONCE_SALT}"
                  }
                ]
              }
            ]
        EOT
      ~ vars     = {
          + "ENCRYPTION_KEY"               = (known after apply)
          - "LIST_MANAGER_API_KEY"         = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_api_key_9tv4ch-K7g2ss" -> null
          - "LIST_MANAGER_NOTIFY_SERVICES" = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_notify_services_9tv4ch-nRDzt1" -> null
          - "LIST_MANAGER_SERVICE_ID"      = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_service_id_9tv4ch-qqjeOC" -> null
          - "NOTIFY_API_KEY"               = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:notify_api_key_9tv4ch-wb4Z7G" -> null
            # (20 unchanged elements hidden)
        }
    }

  # aws_ecs_service.wordpress_service will be updated in-place
  ~ resource "aws_ecs_service" "wordpress_service" {
        id                                 = "arn:aws:ecs:ca-central-1:729164266357:service/wordpress/wordpress"
        name                               = "wordpress"
        tags                               = {
            "CostCentre" = "PlatformGCArticles"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:729164266357:task-definition/wordpress:10" -> (known after apply)
        # (14 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.wordpress_task must be replaced
-/+ resource "aws_ecs_task_definition" "wordpress_task" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:729164266357:task-definition/wordpress:10" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "DEFAULT_DOMAIN"
                          - value = "articles.cdssandbox.xyz"
                        },
                      - {
                          - name  = "WORDPRESS_CONFIG_EXTRA"
                          - value = "define('WP_HOME','https://articles.cdssandbox.xyz');define('WP_SITEURL','https://articles.cdssandbox.xyz');define('MYSQL_CLIENT_FLAGS', MYSQLI_CLIENT_SSL);"
                        },
                    ]
                  - essential        = true
                  - image            = "729164266357.dkr.ecr.ca-central-1.amazonaws.com/platform/wordpress:v1.5.2"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "wordpress"
                  - portMappings     = [
                      - {
                          - containerPort = 443
                          - hostPort      = 443
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "LIST_MANAGER_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_api_key_9tv4ch-K7g2ss"
                        },
                      - {
                          - name      = "LIST_MANAGER_ENDPOINT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_endpoint_9tv4ch-S5UpJr"
                        },
                      - {
                          - name      = "LIST_MANAGER_SERVICE_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_service_id_9tv4ch-qqjeOC"
                        },
                      - {
                          - name      = "LIST_MANAGER_NOTIFY_SERVICES"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_notify_services_9tv4ch-nRDzt1"
                        },
                      - {
                          - name      = "NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:notify_api_key_9tv4ch-wb4Z7G"
                        },
                      - {
                          - name      = "WORDPRESS_DB_HOST"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0"
                        },
                      - {
                          - name      = "WORDPRESS_DB_USER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_username_j5ihus-33gyWe"
                        },
                      - {
                          - name      = "WORDPRESS_DB_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_password_j5ihus-DCw572"
                        },
                      - {
                          - name      = "WORDPRESS_DB_NAME"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_name_j5ihus-XAAsB4"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_key_9tv4ch-Odjot9"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_key_9tv4ch-c1FG85"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_key_9tv4ch-cu7bvO"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_key_9tv4ch-rD16Mn"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_salt_9tv4ch-7Z7et4"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_salt_9tv4ch-esn0hB"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_salt_9tv4ch-fHVfaV"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_salt_9tv4ch-rfqWnb"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "wordpress" -> (known after apply)
      ~ revision                 = 10 -> (known after apply)
        tags                     = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.wordpress_ecs_task_get_secret_value will be updated in-place
  ~ resource "aws_iam_policy" "wordpress_ecs_task_get_secret_value" {
        id        = "arn:aws:iam::729164266357:policy/WordpressEcsTaskGetSecretValue"
        name      = "WordpressEcsTaskGetSecretValue"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_salt_9tv4ch-esn0hB",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_key_9tv4ch-c1FG85",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_salt_9tv4ch-rfqWnb",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_key_9tv4ch-rD16Mn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_salt_9tv4ch-fHVfaV",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_key_9tv4ch-cu7bvO",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_username_j5ihus-33gyWe",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_password_j5ihus-DCw572",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_name_j5ihus-XAAsB4",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_salt_9tv4ch-7Z7et4",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_key_9tv4ch-Odjot9",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:notify_api_key_9tv4ch-wb4Z7G",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_service_id_9tv4ch-qqjeOC",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_notify_services_9tv4ch-nRDzt1",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_endpoint_9tv4ch-S5UpJr",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_api_key_9tv4ch-K7g2ss",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.encryption_key will be created
  + resource "aws_secretsmanager_secret" "encryption_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "encryption_key_9tv4ch"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret.list_manager_api_key will be destroyed
  - resource "aws_secretsmanager_secret" "list_manager_api_key" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_api_key_9tv4ch-K7g2ss" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_api_key_9tv4ch-K7g2ss" -> null
      - name                           = "list_manager_api_key_9tv4ch" -> null
      - recovery_window_in_days        = 30 -> null
      - rotation_enabled               = false -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
    }

  # aws_secretsmanager_secret.list_manager_notify_services will be destroyed
  - resource "aws_secretsmanager_secret" "list_manager_notify_services" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_notify_services_9tv4ch-nRDzt1" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_notify_services_9tv4ch-nRDzt1" -> null
      - name                           = "list_manager_notify_services_9tv4ch" -> null
      - recovery_window_in_days        = 30 -> null
      - rotation_enabled               = false -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
    }

  # aws_secretsmanager_secret.list_manager_service_id will be destroyed
  - resource "aws_secretsmanager_secret" "list_manager_service_id" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_service_id_9tv4ch-qqjeOC" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_service_id_9tv4ch-qqjeOC" -> null
      - name                           = "list_manager_service_id_9tv4ch" -> null
      - recovery_window_in_days        = 30 -> null
      - rotation_enabled               = false -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
    }

  # aws_secretsmanager_secret.notify_api_key will be destroyed
  - resource "aws_secretsmanager_secret" "notify_api_key" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:notify_api_key_9tv4ch-wb4Z7G" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:notify_api_key_9tv4ch-wb4Z7G" -> null
      - name                           = "notify_api_key_9tv4ch" -> null
      - recovery_window_in_days        = 30 -> null
      - rotation_enabled               = false -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
    }

  # aws_secretsmanager_secret_version.encryption_key will be created
  + resource "aws_secretsmanager_secret_version" "encryption_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.list_manager_api_key will be destroyed
  - resource "aws_secretsmanager_secret_version" "list_manager_api_key" {
      - arn            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_api_key_9tv4ch-K7g2ss" -> null
      - id             = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_api_key_9tv4ch-K7g2ss|3D31FFCB-C9C8-44DE-AA5B-D0A77D619546" -> null
      - secret_binary  = (sensitive value)
      - secret_id      = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_api_key_9tv4ch-K7g2ss" -> null
      - secret_string  = (sensitive value)
      - version_id     = "3D31FFCB-C9C8-44DE-AA5B-D0A77D619546" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # aws_secretsmanager_secret_version.list_manager_notify_services will be destroyed
  - resource "aws_secretsmanager_secret_version" "list_manager_notify_services" {
      - arn            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_notify_services_9tv4ch-nRDzt1" -> null
      - id             = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_notify_services_9tv4ch-nRDzt1|ED7A4207-5C1F-4B55-B133-1FCCEC53AE28" -> null
      - secret_binary  = (sensitive value)
      - secret_id      = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_notify_services_9tv4ch-nRDzt1" -> null
      - secret_string  = (sensitive value)
      - version_id     = "ED7A4207-5C1F-4B55-B133-1FCCEC53AE28" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # aws_secretsmanager_secret_version.list_manager_service_id will be destroyed
  - resource "aws_secretsmanager_secret_version" "list_manager_service_id" {
      - arn            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_service_id_9tv4ch-qqjeOC" -> null
      - id             = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_service_id_9tv4ch-qqjeOC|7DCED507-1EB8-4E25-980B-1D1DFE643342" -> null
      - secret_binary  = (sensitive value)
      - secret_id      = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_service_id_9tv4ch-qqjeOC" -> null
      - secret_string  = (sensitive value)
      - version_id     = "7DCED507-1EB8-4E25-980B-1D1DFE643342" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # aws_secretsmanager_secret_version.notify_api_key will be destroyed
  - resource "aws_secretsmanager_secret_version" "notify_api_key" {
      - arn            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:notify_api_key_9tv4ch-wb4Z7G" -> null
      - id             = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:notify_api_key_9tv4ch-wb4Z7G|A359D195-55F6-42EF-9D87-7797A6878B5E" -> null
      - secret_binary  = (sensitive value)
      - secret_id      = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:notify_api_key_9tv4ch-wb4Z7G" -> null
      - secret_string  = (sensitive value)
      - version_id     = "A359D195-55F6-42EF-9D87-7797A6878B5E" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

Plan: 3 to add, 2 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>